#+Title: Lab Journal January 10, 2022
#+Author: Lucas Myers

* To-do for today

** TODO Download packages on XSpanse [6/8]
:LOGBOOK:
CLOCK: [2022-01-10 Mon 11:47]--[2022-01-10 Mon 14:50] =>  3:03
CLOCK: [2022-01-10 Mon 10:08]--[2022-01-10 Mon 11:25] =>  1:17
:END:
- [X] zlib
  - Name: zlib/1.2.11
  - Dependencies: cpu/0.15.4 intel/19.1.1.217
- [X] Boost 1.74
  - Name: boost/1.74.0
  - Dependencies: cpu/0.15.4  gcc/10.2.0
  - Dependencies: cpu/0.15.4  gcc/10.2.0  openmpi/4.0.4
  - Dependencies: cpu/0.15.4  gcc/9.2.0
- [X] CUDA
  - Name: cuda/11.0.2
  - Dependencies: gpu/0.15.4
  - Dependencies: gpu/0.15.4  gcc/7.2.0
- [X] LAPACK
  - Name: netlib-lapack/3.8.0
  - Dependencies: cpu/0.15.4  gcc/9.2.0
- [X] MPI
  - Name: openmpi/4.1.1
  - Dependencies: cpu/0.15.4  gcc/9.2.0
- [ ] p4est
  - MPI C test failed
- [ ] petsc
- [X] TBB
  - Name: intel-tbb/2020.3
  - Dependencies: gpu/0.15.4  intel/19.0.5.281
** TODO Look back at hydrodynamic equations [0/4]
- [ ] Figure out behavior that Jorge was talking about with constant
- [ ] Figure out how Giomi derived those equations
- [ ] Characterize hydrodynamic constant for other formalisms
- [ ] Map BE onto Giomi hydrodynamics
** DONE Continue writing time-dependent non-hydro [3/3]
CLOSED: [2022-01-10 Mon 17:39]
:LOGBOOK:
CLOCK: [2022-01-10 Mon 16:05]--[2022-01-10 Mon 17:39] =>  1:34
CLOCK: [2022-01-10 Mon 14:00]--[2022-01-10 Mon 15:51] =>  1:51
:END:
- [X] Write out structure (necessary methods and class parameters)
- [X] Fill in structure one method at a time
- [X] Run simulation and output results
